app/controllers/accounts_controller.rb

    def set_account
        @account = Account.find_by_username(params[:username])
---
SELECT "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "testuser"], ["LIMIT", 1]]