app/controllers/posts_controller.rb

INSERT INTO "posts" ("image", "active", "account_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["image", "IMG_0063.JPG"], ["active", true], ["account_id", 1], ["created_at", "2021-01-07 08:41:03.886350"], ["updated_at", "2021-01-07 08:41:03.886350"]]
---
    def create
        @post = Post.new(post_params)
        @post.account_id =current_account.id if account_signed_in?

        if @post.save