app/views/accounts/profile.html.erb

            <%= link_to "Edit Profile", edit_account_registration_path, class: "btn btn-secondary"%>
            <div class="profile-stats"><%= @account.posts.count %> posts</div>
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."account_id" = $1  [["account_id", 1]]